In [1]:
people = {
    "first": ["Sueda", 'Jane', 'John'], 
    "last": ["Ciftci", 'ozg', 'Doe'], 
    "email": ["sueda@gmail.com", 'edasu@email.com', 'doee@email.com']
}

In [2]:
people['email']

['sueda@gmail.com', 'edasu@email.com', 'doee@email.com']

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   first    last            email
0  Sueda  Ciftci  sueda@gmail.com
1   Jane     ozg  edasu@email.com
2   John     Doe   doee@email.com

In [10]:
df['first'] + ' ' + df['last']

0    Sueda Ciftci
1        Jane ozg
2        John Doe
dtype: object

In [11]:
df['full name'] = df['first'] + ' ' + df['last']
#add column we can use apply meth for some other math aanalysis

In [12]:
df

   first    last            email     full name
0  Sueda  Ciftci  sueda@gmail.com  Sueda Ciftci
1   Jane     ozg  edasu@email.com      Jane ozg
2   John     Doe   doee@email.com      John Doe

In [34]:
#delete column

In [15]:
#apply the change permanently
df.drop(columns=['first', 'last'], inplace=True)

In [35]:
df

             email     full name
0  sueda@gmail.com  Sueda Ciftci
1  edasu@email.com      Jane ozg
2   doee@email.com      John Doe

In [36]:
df['full name'].str.split(' ')
#split we get the firt and last name in a list

0    [Sueda, Ciftci]
1        [Jane, ozg]
2        [John, Doe]
Name: full name, dtype: object

In [37]:
#so we need to expand this list so they can be in dif columns
df['full name'].str.split(' ', expand=True)

       0       1
0  Sueda  Ciftci
1   Jane     ozg
2   John     Doe

In [38]:
#add 2 columns in df and those columns we just return
#multiple brakest to access the columns (inner braket)
df[['first', 'last']] = df['full name'].str.split(' ', expand=True)

In [39]:
df

             email     full name  first    last
0  sueda@gmail.com  Sueda Ciftci  Sueda  Ciftci
1  edasu@email.com      Jane ozg   Jane     ozg
2   doee@email.com      John Doe   John     Doe

In [41]:
#add row  with append
df.append({'first': 'Tony'}, ignore_index=True)

             email     full name  first    last
0  sueda@gmail.com  Sueda Ciftci  Sueda  Ciftci
1  edasu@email.com      Jane ozg   Jane     ozg
2   doee@email.com      John Doe   John     Doe
3              NaN           NaN   Tony     NaN

In [45]:
people = {
    "first": ["Sansa", 'Arya'], 
    "last": ["Stark", 'Noone'],
    "email": ["sansa@gmail.com", "arya@email.com"]
}
df2 = pd.DataFrame(people)
df2

   first   last            email
0  Sansa  Stark  sansa@gmail.com
1   Arya  Noone   arya@email.com

In [51]:
df = df.append(df2, ignore_index=True)
df

             email     full name  first    last
0  sueda@gmail.com  Sueda Ciftci  Sueda  Ciftci
1  edasu@email.com      Jane ozg   Jane     ozg
2   doee@email.com      John Doe   John     Doe
3  sansa@gmail.com           NaN  Sansa   Stark
4   arya@email.com           NaN   Arya   Noone
5  sansa@gmail.com           NaN  Sansa   Stark
6   arya@email.com           NaN   Arya   Noone

In [50]:
#removing rows
df.drop(index=4)

             email     full name  first    last
0  sueda@gmail.com  Sueda Ciftci  Sueda  Ciftci
1  edasu@email.com      Jane ozg   Jane     ozg
2   doee@email.com      John Doe   John     Doe
3  sansa@gmail.com           NaN  Sansa   Stark

In [ ]:
#we can pass the condition from inside bracket ,we use . index
cond = df['last'] == 'Doe'
df.drop(index=df[cond].index)